app/controllers/api/games_controller.rb

SELECT "games".* FROM "games"
---
  def index
    render json: Game.all

INSERT INTO "games" ("publisher_id", "name", "platform", "store_id", "bundle_id", "app_version", "is_published", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    render json: Game.create(game_attributes)

UPDATE "games" SET "platform" = ?, "updated_at" = ? WHERE "games"."id" = ?  [["platform", "android"], ["updated_at", "2022-05-04 21:04:28.475856"], ["id", 980190963]]
---
  def update
    render json: Game.update(params[:id], game_attributes)

SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 980190963], ["LIMIT", 1]]
DELETE FROM "games" WHERE "games"."id" = ?  [["id", 980190963]]
---
  def destroy
    game = Game.find(params[:id])

    game.destroy